[
    {
        "_id": "L9JZJYZMfAkhEdwaHtk5L",
        "content": "Фронтенд-разработчик не просто верстает макеты. Он хорошо знает JavaScript, разбирается во фреймворках и библиотеках (и активно юзает часть из них), понимает, что находится «под капотом» на серверной стороне. \nЕго не пугают препроцессоры и сборщики LESS, SASS, GRUNT, GULP, он умеет работать с DOM, API, SVG-объектами, AJAX и CORS, может составлять SQL-запросы и копаться в данных. Получается сборная солянка навыков, к которым добавляется понимание принципов UI/UX-проектирования, адаптивной и отзывчивой верстки, кросс-браузерности и кросс-платформенности, а иногда и навыков мобильной разработки.Фронтендщик в обязательном порядке умеет работать с контролем версий (Git, GitHub, CVS и т. д.), использовать графические редакторы, «играть» с шаблонами различных CMS. Еще крайне желательно знать английский язык, чтобы не переводить спецификацию в Гугл-переводчике, уметь работать в команде, иногда мультиязычной, разбираться в веб-шрифтах, ну и понимать тестировщиков и сам процесс тестирования.",
        "description": "Фронтенд-разработчик не просто верстает макеты...",
        "link": "https://habr.com/ru/company/netologyru/blog/327294/",
        "title": "Что должен знать фронтенд-разработчик",
        "userId": "Uqxb9kkzPRZuHfCu5nw8uFjN8Bn1"
    },
    {
        "_id": "NQWgpT2mmeBUXS6nZAxB_",
        "content": "Llanfairpwllgwyngyllgogerychwyrndrobwllll- antysiliogogogoch (Лланвайрпуллгуингиллгогерихуирндробуллллантисилиогогого́х) - небольшой городок в Northern Wales (Северном Уэльсе), где около 76% населения speaks Welsh (говорит на валлийском). Это также самое длинное название города в Европе с 58 letters (58 буквами), в котором literally four Ls (буквально четыре L), стоящие друг за другом. Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch - это не оригинальное название деревни. В 1860-х годах имя было придумано the local cobbler (местным сапожником), и оно предназначалось для привлечения туристов.",
        "description": "Llanfairpwllgwyngyllgogerychwyrndrobwllll...",
        "link": "https://zen.yandex.ru/media/albion/gorod-v-uelse-s-samym-dlinnym-nazvaniem-v-evrope-5bd962a2e627ba00aa8e4e7d",
        "title": "Необычное имя маленького городка",
        "userId": "Uqxb9kkzPRZuHfCu5nw8uFjN8Bn1"
    },
    {
        "_id": "eSN8en3ra5FNOvdTJUJv9",
        "content": "Фотоны — элементарные безмассовые частицы, кванты электромагнитного излучения, которые мы воспринимаем как свет. Множество фотонов попадают на окружающие нас предметы и отражаются в сетчатку нашего глаза, давая нам возможность видеть.  Казалось бы, подсчитать количество фотонов во Вселенной — задача невозможная. Но так не считают физики из университета Клемсона, США. Чтобы понять хотя бы приблизительное количество фотонов в нашем мире, необходимо учитывать все время существования Вселенной — около 13,7 млрд. лет. Ведь свет, испущенный уже давно погибшими звездами, до сих пор летит сквозь пространство. За основу расчетов ученые взяли показатели так называемого внегалактического фонового излучения (extragalactic background light — EBL), которое накапливается в инфракрасном, видимом и ультрафиолетовом диапазонах после формирования звезд. Даже с помощью самой современной техники EBL заметить очень сложно — оно легко гасится другими излучениями, которыми буквально пронизана наша Вселенная. Но ученые нашли оригинальный способ, который все же помог проанализировать внегалактическое фоновое излучение — блазары.  Испущенные блазарами джеты распространяются на сотни миллионов световых лет, а их излучение ослабевает по мере прохождение через EBL. Получается, что блазары, разбросанные по всему космосу, представляют собой отличную возможность изучить интенсивность и количество испущенного звездами света в различные этапы жизни Вселенной по мере ее старения и расширения. Проанализировав 739 блазара, физики смогли назвать приблизительное количество фотонов, которые существуют в нашей Вселенной: 4 x 1084. Или, если вам не лень считать нули:  4 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 000 фотонов.",
        "description": "Казалось бы, подсчитать количество фотонов во Вселенной — задача невозможная. Но...",
        "link": "https://mydiscoveries.ru/skolko-fotonov-vo-vselennoy",
        "title": "Сколько фотонов во Вселенной?",
        "userId": "Uqxb9kkzPRZuHfCu5nw8uFjN8Bn1"
    },
    {
        "_id": "enjVDJYUtbgX7tzg26Dws",
        "content": "Псевдопарадокс, который исходит из двух народных мудростей: что кошки всегда приземляются на лапы, а бутерброды всегда падают маслом вниз. Но что будет, если бутерброд с маслом прикрепить к спине кошки? Кое-кто в шутку утверждает, что в результате эксперимента возникнет антигравитация или что кошка слижет масло и приземлится на лапы. Более серьезные исследователи тоже комментируют парадокс кошки с маслом. Дональд Е. Симанек пишет: «На самом деле никакого противоречия нет. Даже если предположить, что кошки всегда приземляются на лапы, а бутерброды с маслом всегда падают маслом вниз, то в первом случае на лапы приземлится кошка, а бутерброд так и останется не упавшим. Во втором — маслом вниз упадет бутерброд, а кошка будет не упавшей». А В. Ножнов утверждает, что кошка с привязанным бутербродом является составным объектом и поэтому не может являться кошкой в первом правиле или бутербродом из второго правила.",
        "description": "Псевдопарадокс, который исходит из двух народных мудростей",
        "link": "https://ru.wikipedia.org/wiki/%D0%9F%D0%B0%D1%80%D0%B0%D0%B4%D0%BE%D0%BA%D1%81_%D0%BA%D0%BE%D1%88%D0%BA%D0%B8_%D1%81_%D0%BC%D0%B0%D1%81%D0%BB%D0%BE%D0%BC",
        "title": "Парадокс кошки с маслом",
        "userId": "GBVon62fEHOOuB0INKkMMe8XJEB2"
    }
]
