{
    "articles": [
        {
            "_id": 1,
            "title": "Что должен знать фронтенд-разработчик",
            "content": "Фронтенд-разработчик не просто верстает макеты. Он хорошо знает JavaScript, разбирается во фреймворках и библиотеках (и активно юзает часть из них), понимает, что находится «под капотом» на серверной стороне. Его не пугают препроцессоры и сборщики LESS, SASS, GRUNT, GULP, он умеет работать с DOM, API, SVG-объектами, AJAX и CORS, может составлять SQL-запросы и копаться в данных. Получается сборная солянка навыков, к которым добавляется понимание принципов UI/UX-проектирования, адаптивной и отзывчивой верстки, кросс-браузерности и кросс-платформенности, а иногда и навыков мобильной разработки.Фронтендщик в обязательном порядке умеет работать с контролем версий (Git, GitHub, CVS и т. д.), использовать графические редакторы, «играть» с шаблонами различных CMS. Еще крайне желательно знать английский язык, чтобы не переводить спецификацию в Гугл-переводчике, уметь работать в команде, иногда мультиязычной, разбираться в веб-шрифтах, ну и понимать тестировщиков и сам процесс тестирования.",
            "link": "https://habr.com/ru/company/netologyru/blog/327294/"
        },
        {
            "_id": 2,
            "title": "Лланвайрпуллгуингиллгогерихуирндробуллллантисилиогогого́х",
            "content": "Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch (Лланвайрпуллгуингиллгогерихуирндробуллллантисилиогогого́х) - небольшой городок в Northern Wales (Северном Уэльсе), где около 76% населения speaks Welsh (говорит на валлийском). Это также самое длинное название города в Европе с 58 letters (58 буквами), в котором literally four Ls (буквально четыре L), стоящие друг за другом. Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch - это не оригинальное название деревни. В 1860-х годах имя было придумано the local cobbler (местным сапожником), и оно предназначалось для привлечения туристов. ",
            "link": "https://zen.yandex.ru/media/albion/gorod-v-uelse-s-samym-dlinnym-nazvaniem-v-evrope-5bd962a2e627ba00aa8e4e7d"
        },
        {
            "_id": 3,
            "title": "Парадокс кошки с маслом",
            "content": "Псевдопарадокс, который исходит из двух народных мудростей: что кошки всегда приземляются на лапы, а бутерброды всегда падают маслом вниз. Но что будет, если бутерброд с маслом прикрепить к спине кошки? Кое-кто в шутку утверждает, что в результате эксперимента возникнет антигравитация или что кошка слижет масло и приземлится на лапы. Более серьезные исследователи тоже комментируют парадокс кошки с маслом. Дональд Е. Симанек пишет: «На самом деле никакого противоречия нет. Даже если предположить, что кошки всегда приземляются на лапы, а бутерброды с маслом всегда падают маслом вниз, то в первом случае на лапы приземлится кошка, а бутерброд так и останется не упавшим. Во втором — маслом вниз упадет бутерброд, а кошка будет не упавшей». А В. Ножнов утверждает, что кошка с привязанным бутербродом является составным объектом и поэтому не может являться кошкой в первом правиле или бутербродом из второго правила.",
            "link": "https://ru.wikipedia.org/wiki/%D0%9F%D0%B0%D1%80%D0%B0%D0%B4%D0%BE%D0%BA%D1%81_%D0%BA%D0%BE%D1%88%D0%BA%D0%B8_%D1%81_%D0%BC%D0%B0%D1%81%D0%BB%D0%BE%D0%BC"
        }
    ]
}
